[
  {
    "Id": "anwei_root",
    "SpeakerName": "Northern Han Remnant Soldier",
    "Text": "Hello mighty warrior and welcome in this temple, here resides the evil wizzard. You are ready to defeat him, right?",
    "Choices": [
      { "ChoiceText": "Isn't it dangerous?", "NextId": "anwei_dangerous" }
    ]
  },
  {
    "Id": "anwei_dangerous",
    "SpeakerName": "Northern Han Remnant Soldier",
    "Text": "Yes it will be dangerous, but the whole land depends on you, you don't want to end op as an anti-hero, like that pathatic warrior that was chosen to defeat the wizard before you.",
    "Choices": [
      { "ChoiceText": "More ready than ever!", "NextId": "anwei_ready" }
    ]
  },
  {
    "Id": "anwei_ready",
    "SpeakerName": "Northern Han Remnant Soldier",
    "Text": "Thank you warrior for your help! It won't be easy but we believe in you, give that wizard the karma he deserves!",
    "Choices": []
  },
  {
    "Id": "archer_root",
    "SpeakerName": "Khitan Border Raider",
    "Text": "This temple here is the evil creation of that wizard, it is designed to test your strenght and willpower. It will not be easy as the temple might appear like some labyrinth. But you must persist, or the curse of that evil mastermind of a wizard will destroy our entire land and all we will ever know is death and endless shadow.",
    "Choices": []
  },
  {
    "Id": "wizard_root",
    "SpeakerName": "Khitan Border Raider #2",
    "Text": "Hello there, we were send here by emperor to welcome the warriors who are brave enough to enter this dangerous temple do you have a question?",
    "Choices": [
      { "ChoiceText": "What is my reward?", "NextId": "wizard_denial" }
    ]
  },
  {
    "Id": "wizard_denial",
    "SpeakerName": "Khitan Border Raider #2",
    "Text": "The emperor has promised to cover the one who defeats the wizard with wealth. If you wish your whole house could even be bejeweled, I don't know why you would want that though.",
    "Choices": [ 
      { "ChoiceText": "Why don't we go together?", "NextId": "wizard_solution" }
    ]
  },
  {
    "Id": "wizard_solution",
    "SpeakerName": "Khitan Border Raider #2",
    "Text": "Why we have to stay here you ask? Well, there are multiple enemies ahead, and we are not strong enough to defeat them, so only a warrior like you can defeat him. Sorry, but when you enter the temple, you're on own, kid.",
    "Choices": [
    ]
  },
  {
    "Id": "test_boss_intro",
    "SpeakerName": "Evil Wizzard",
    "Text": "Hello there you pathetic little warrior, it seems like you made it through all of my guards. How brave of you, you're already better than that even more pathetic warrior that came before you. He only made it through the first level, before cowardly running away. Not that any of that matters, because you might've been able to defeat my guards, but know that that was just the warmup. You will never be able to defeat me, the great evil wizzard, and stop my spell from casting an eternal shadow over this land; destroying the empire and making me the ruler over the whole land! HAHAHAHAHA!",
    "Choices": []
  }
]
